99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_image.c
#include "esp32_mquickjs_bitmap_internal.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP

#include "esp32_mquickjs_future.h"
#include "utils/esp32_mquickjs_byte_source.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
#include "esp32_mquickjs_camera.h"
#endif

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdatomic.h>
#include <string.h>

#include "esp_heap_caps.h"

#define BITMAP_CONVERT_API "bitmap.convert()"
#define BITMAP_BLIT_API "Bitmap.blit()"
#define BITMAP_BLIT_BATCH_API "Bitmap.blitBatch()"
#define BITMAP_BLIT_BATCH_MAX_OPERATIONS 16U

typedef enum {
    BITMAP_SOURCE_NONE = 0,
    BITMAP_SOURCE_BITMAP,
    BITMAP_SOURCE_CAMERA,
    BITMAP_SOURCE_BYTE_VIEW,
    BITMAP_SOURCE_STAGING,
} bitmap_source_owner_t;

struct esp32_mquickjs_future_driver_state {
    JSContext *ctx;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    JSGCRef source_ref;
    JSGCRef pixels_ref;
    JSGCRef target_ref;
    bool source_rooted;
    bool pixels_rooted;
    bool target_rooted;
    bool target_write_acquired;
    bool convert;
    bool batch;
    bool started;
    _Atomic bool completed;
    _Atomic bool cancelled;
    bitmap_source_owner_t source_owner;
    esp32_mquickjs_bitmap_view_t source;
    esp32_mquickjs_bitmap_target_t target;
    esp32_mquickjs_bitmap_transform_options_t options;
    esp32_mquickjs_bitmap_t *source_bitmap;
    esp32_mquickjs_bitmap_t *target_bitmap;
    esp32_mquickjs_bitmap_t *result_bitmap;
#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
    esp32_mquickjs_camera_bitmap_lease_t camera_lease;
#endif
    uint8_t *staging;
    uint32_t rows_completed;
    esp32_mquickjs_bitmap_dirty_rect_t dirty;
    esp32_mquickjs_bitmap_transform_result_t result;
    struct esp32_mquickjs_future_driver_state *operations;
    uint32_t operation_count;
};

static bool value_is_object(JSContext *ctx, JSValue value)
{
    return JS_GetClassID(ctx, value) >= 0 && !JS_IsArray(ctx, value);
}

static bool read_u32_property(JSContext *ctx,
                              JSValue object,
                              const char *name,
                              const char *api_name,
                              uint32_t *out,
                              bool *out_present)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool ok = true;

    *out_present = false;
    *property = JS_GetPropertyStr(ctx, object, name);
    if (JS_IsException(*property)) {
        ok = false;
    } else if (!JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        if (!value_to_u32(ctx, *property, out)) {
            JS_ThrowTypeError(ctx,
                              "%s option '%s' expects a non-negative integer",
                              api_name, name);
            ok = false;
        } else {
            *out_present = true;
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static bool read_i32_property(JSContext *ctx,
                              JSValue object,
                              const char *name,
                              const char *api_name,
                              int32_t *out,
                              bool *out_present)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool ok = true;

    *out_present = false;
    *property = JS_GetPropertyStr(ctx, object, name);
    if (JS_IsException(*property)) {
        ok = false;
    } else if (!JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        if (!value_to_i32(ctx, *property, out)) {
            JS_ThrowTypeError(ctx, "%s option '%s' expects an integer",
                              api_name, name);
            ok = false;
        } else {
            *out_present = true;
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static bool read_bool_property(JSContext *ctx,
                               JSValue object,
                               const char *name,
                               const char *api_name,
                               bool *out,
                               bool *out_present)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool ok = true;

    *out_present = false;
    *property = JS_GetPropertyStr(ctx, object, name);
    if (JS_IsException(*property)) {
        ok = false;
    } else if (!JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        if (!JS_IsBool(*property)) {
            JS_ThrowTypeError(ctx, "%s option '%s' expects a boolean",
                              api_name, name);
            ok = false;
        } else {
            *out = *property == JS_TRUE;
            *out_present = true;
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static bool read_string_property(JSContext *ctx,
                                 JSValue object,
                                 const char *name,
                                 const char *api_name,
                                 const char **out,
                                 JSCStringBuf *out_buf,
                                 bool *out_present)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool ok = true;

    *out = NULL;
    *out_present = false;
    *property = JS_GetPropertyStr(ctx, object, name);
    if (JS_IsException(*property)) {
        ok = false;
    } else if (!JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        if (!JS_IsString(ctx, *property) ||
            (*out = JS_ToCString(ctx, *property, out_buf)) == NULL) {
            JS_ThrowTypeError(ctx, "%s option '%s' expects a string",
                              api_name, name);
            ok = false;
        } else {
            *out_present = true;
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static bool parse_format(const char *name,
                         esp32_mquickjs_bitmap_pixel_format_t *out)
{
    return esp32_mquickjs_bitmap_parse_format(name, out);
}

static bool parse_layout(const char *name,
                         esp32_mquickjs_bitmap_pixel_format_t format,
                         bool descriptor,
                         esp32_mquickjs_bitmap_layout_t *out)
{
    const esp32_mquickjs_bitmap_format_info_t *info =
        esp32_mquickjs_bitmap_format_info(format);
    esp32_mquickjs_bitmap_layout_t layout;

