99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_image.c
    if (info == NULL || out == NULL) {
        return false;
    }
    if (name == NULL) {
        layout = descriptor ? ESP32_MQUICKJS_BITMAP_LAYOUT_LINEAR
                            : info->default_layout;
    } else if (strcmp(name, "linear") == 0) {
        layout = ESP32_MQUICKJS_BITMAP_LAYOUT_LINEAR;
    } else if (strcmp(name, "page-y8") == 0) {
        layout = ESP32_MQUICKJS_BITMAP_LAYOUT_PAGE_Y8;
    } else {
        return false;
    }
    if ((info->allowed_layouts & (1U << layout)) == 0) {
        return false;
    }
    *out = layout;
    return true;
}

static bool parse_byte_order(const char *name,
                             esp32_mquickjs_bitmap_byte_order_t *out)
{
    if (name == NULL || strcmp(name, "be") == 0) {
        *out = ESP32_MQUICKJS_BITMAP_BYTE_ORDER_BE;
        return true;
    }
    if (strcmp(name, "le") == 0) {
        *out = ESP32_MQUICKJS_BITMAP_BYTE_ORDER_LE;
        return true;
    }
    return false;
}

static bool parse_bit_order(const char *name,
                            esp32_mquickjs_bitmap_bit_order_t *out)
{
    if (name == NULL || strcmp(name, "lsb") == 0) {
        *out = ESP32_MQUICKJS_BITMAP_BIT_ORDER_LSB;
        return true;
    }
    if (strcmp(name, "msb") == 0) {
        *out = ESP32_MQUICKJS_BITMAP_BIT_ORDER_MSB;
        return true;
    }
    return false;
}

static bool parse_storage(const char *name, uint8_t *out)
{
    if (name == NULL || strcmp(name, "auto") == 0) {
        *out = BITMAP_STORAGE_AUTO;
        return true;
    }
    if (strcmp(name, "internal") == 0) {
        *out = BITMAP_STORAGE_INTERNAL;
        return true;
    }
    if (strcmp(name, "psram") == 0) {
        *out = BITMAP_STORAGE_PSRAM;
        return true;
    }
    if (strcmp(name, "dma") == 0) {
        *out = BITMAP_STORAGE_DMA;
        return true;
    }
    return false;
}

static bool root_value(JSContext *ctx,
                       JSGCRef *ref,
                       bool *rooted,
                       JSValue value)
{
    JSValue *slot = JS_AddGCRef(ctx, ref);

    if (slot == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    *slot = value;
    *rooted = true;
    return true;
}

static bool source_from_bitmap(
    JSContext *ctx,
    JSValue value,
    const char *api_name,
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_bitmap_t *buffer =
        bitmap_from_value(ctx, value, api_name);

    if (buffer == NULL || !bitmap_acquire_read(ctx, buffer, api_name) ||
        !root_value(ctx, &state->source_ref, &state->source_rooted, value)) {
        if (buffer != NULL && buffer->read_leases != 0) {
            bitmap_release_read(buffer);
        }
        return false;
    }
    state->source_owner = BITMAP_SOURCE_BITMAP;
    state->source_bitmap = buffer;
    state->source.data = buffer->data;
    state->source.length = buffer->byte_length;
    state->source.width = buffer->width;
    state->source.height = buffer->height;
    state->source.stride = buffer->stride;
    state->source.format =
        (esp32_mquickjs_bitmap_pixel_format_t)buffer->format;
    state->source.layout = (esp32_mquickjs_bitmap_layout_t)buffer->layout;
    state->source.byte_order = ESP32_MQUICKJS_BITMAP_BYTE_ORDER_BE;
    state->source.bit_order = ESP32_MQUICKJS_BITMAP_BIT_ORDER_LSB;
    return true;
}

static bool source_from_descriptor(
    JSContext *ctx,
    JSValue value,
    const char *api_name,
    esp32_mquickjs_future_driver_state_t *state)
{
    JSCStringBuf format_buf;
    JSCStringBuf layout_buf;
    JSCStringBuf byte_order_buf;
    JSCStringBuf bit_order_buf;
    const char *format_name = NULL;
    const char *layout_name = NULL;
    const char *byte_order_name = NULL;
    const char *bit_order_name = NULL;
    bool present;
    bool format_present;
    bool layout_present;
    bool byte_order_present;
    bool bit_order_present;
    uint32_t computed_stride;
    size_t required;
    JSGCRef pixels_local_ref;
    JSValue *pixels = JS_PushGCRef(ctx, &pixels_local_ref);
    JSValue error = JS_UNDEFINED;
    esp32_mquickjs_byte_source_t bytes;

    if (!value_is_object(ctx, value)) {
        JS_PopGCRef(ctx, &pixels_local_ref);
        JS_ThrowTypeError(
            ctx,
            "%s source expects a Bitmap, raw CameraFrame, or pixel descriptor",
            api_name);
        return false;
    }
    if (!read_u32_property(ctx, value, "width", api_name,
                           &state->source.width, &present) ||
        !present ||
        !read_u32_property(ctx, value, "height", api_name,
                           &state->source.height, &present) ||
        !present ||
        !read_string_property(ctx, value, "format", api_name, &format_name,
                              &format_buf, &format_present) ||
        !format_present ||
        !read_string_property(ctx, value, "layout", api_name, &layout_name,
                              &layout_buf, &layout_present) ||
        !read_string_property(ctx, value, "byteOrder", api_name,
                              &byte_order_name, &byte_order_buf,
                              &byte_order_present) ||
        !read_string_property(ctx, value, "bitOrder", api_name,
                              &bit_order_name, &bit_order_buf,
                              &bit_order_present)) {
        JS_PopGCRef(ctx, &pixels_local_ref);
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "%s descriptor requires width, height, and format",
                              api_name);
        }
        return false;
    }
    if (state->source.width == 0 || state->source.height == 0 ||
        state->source.width > BITMAP_MAX_DIMENSION ||
        state->source.height > BITMAP_MAX_DIMENSION ||
        !parse_format(format_name, &state->source.format) ||
        !parse_layout(layout_present ? layout_name : NULL,
                      state->source.format, true, &state->source.layout) ||
        !parse_byte_order(byte_order_present ? byte_order_name : NULL,
                          &state->source.byte_order) ||
        !parse_bit_order(bit_order_present ? bit_order_name : NULL,
                         &state->source.bit_order) ||
        (byte_order_present &&
         state->source.format != ESP32_MQUICKJS_BITMAP_FORMAT_RGB565) ||
        (bit_order_present &&
         state->source.format != ESP32_MQUICKJS_BITMAP_FORMAT_MONO1)) {
        JS_PopGCRef(ctx, &pixels_local_ref);
        JS_ThrowTypeError(
            ctx,
            "%s descriptor has an invalid format, layout, byteOrder, or bitOrder",
            api_name);
        return false;
    }
    state->source.stride = 0;
    if (!read_u32_property(ctx, value, "stride", api_name,
                           &state->source.stride, &present) ||
        !esp32_mquickjs_bitmap_compute_storage(
            state->source.width, state->source.height, state->source.format,
            state->source.layout, state->source.stride, &computed_stride,
            &required)) {
        JS_PopGCRef(ctx, &pixels_local_ref);
        if (!JS_HasException(ctx)) {
            JS_ThrowRangeError(ctx, "%s descriptor has invalid dimensions or stride",
                               api_name);
        }
        return false;
    }
    state->source.stride = computed_stride;
    *pixels = JS_GetPropertyStr(ctx, value, "pixels");
    if (JS_IsException(*pixels) || JS_IsUndefined(*pixels) || JS_IsNull(*pixels) ||
        !root_value(ctx, &state->pixels_ref, &state->pixels_rooted, *pixels)) {
        JS_PopGCRef(ctx, &pixels_local_ref);
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "%s descriptor requires pixel bytes",
                              api_name);
        }
        return false;
    }
    if (JS_GetClassID(ctx, *pixels) == JS_CLASS_BYTE_VIEW) {
        if (!esp32_mquickjs_byte_view_acquire_read(
                ctx, *pixels, api_name, &state->source.data,
                &state->source.length)) {
            JS_PopGCRef(ctx, &pixels_local_ref);
            return false;
        }
        state->source_owner = BITMAP_SOURCE_BYTE_VIEW;
    } else if (!esp32_mquickjs_get_byte_source(
                   ctx, *pixels, api_name, &bytes, &state->staging, &error)) {
        JS_PopGCRef(ctx, &pixels_local_ref);
        if (!JS_IsUndefined(error) && !JS_IsException(error)) {
            (void)JS_Throw(ctx, error);
        }
        return false;
    } else {
        state->source.data = bytes.data;
        state->source.length = bytes.length;
        state->source_owner = BITMAP_SOURCE_STAGING;
    }
    JS_PopGCRef(ctx, &pixels_local_ref);
    if (state->source.length < required) {
        JS_ThrowRangeError(ctx, "%s descriptor pixel data is truncated",
                           api_name);
        return false;
    }
    return true;
}

static bool source_from_value(
    JSContext *ctx,
    JSValue value,
    const char *api_name,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (JS_GetClassID(ctx, value) == JS_CLASS_BITMAP) {
        return source_from_bitmap(ctx, value, api_name, state);
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
    if (JS_GetClassID(ctx, value) == JS_CLASS_CAMERA_FRAME) {
        if (!esp32_mquickjs_camera_frame_acquire_bitmap_view(
                ctx, value, api_name, &state->camera_lease) ||
            !root_value(ctx, &state->source_ref, &state->source_rooted,
                        value)) {
            esp32_mquickjs_camera_frame_release_bitmap_view(
                &state->camera_lease);
            return false;
        }
        state->source_owner = BITMAP_SOURCE_CAMERA;
        state->source = state->camera_lease.view;
        return true;
    }
#endif
    return source_from_descriptor(ctx, value, api_name, state);
}

static bool parse_source_rect(
    JSContext *ctx,
    JSValue options,
    const char *api_name,
    const esp32_mquickjs_bitmap_view_t *source,
    esp32_mquickjs_bitmap_transform_options_t *out)
{
    JSGCRef rect_ref;
    JSValue *rect = JS_PushGCRef(ctx, &rect_ref);
    bool present;
    bool value_present;

    out->source_x = 0;
    out->source_y = 0;
    out->source_width = source->width;
    out->source_height = source->height;
    *rect = JS_GetPropertyStr(ctx, options, "sourceRect");
    if (JS_IsException(*rect)) {
        JS_PopGCRef(ctx, &rect_ref);
        return false;
    }
    if (JS_IsUndefined(*rect) || JS_IsNull(*rect)) {
        JS_PopGCRef(ctx, &rect_ref);
        return true;
    }
    if (!value_is_object(ctx, *rect) ||
        !read_u32_property(ctx, *rect, "x", api_name, &out->source_x,
                           &present) ||
        !read_u32_property(ctx, *rect, "y", api_name, &out->source_y,
                           &present) ||
        !read_u32_property(ctx, *rect, "width", api_name,
                           &out->source_width, &value_present) ||
        !value_present ||
        !read_u32_property(ctx, *rect, "height", api_name,
                           &out->source_height, &value_present) ||
        !value_present || out->source_width == 0 || out->source_height == 0 ||
        out->source_x >= source->width || out->source_y >= source->height ||
        out->source_width > source->width - out->source_x ||
        out->source_height > source->height - out->source_y) {
        JS_PopGCRef(ctx, &rect_ref);
        if (!JS_HasException(ctx)) {
            JS_ThrowRangeError(ctx, "%s sourceRect is outside the source",
                               api_name);
        }
        return false;
    }
    JS_PopGCRef(ctx, &rect_ref);
    return true;
}

