99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_image.c
static bool parse_destination_rect(
    JSContext *ctx,
    JSValue options,
    const char *api_name,
    uint32_t natural_width,
    uint32_t natural_height,
    esp32_mquickjs_bitmap_transform_options_t *out)
{
    JSGCRef rect_ref;
    JSValue *rect = JS_PushGCRef(ctx, &rect_ref);
    bool present;
    bool size_present;

    out->destination_x = 0;
    out->destination_y = 0;
    out->destination_width = natural_width;
    out->destination_height = natural_height;
    *rect = JS_GetPropertyStr(ctx, options, "destinationRect");
    if (JS_IsException(*rect)) {
        JS_PopGCRef(ctx, &rect_ref);
        return false;
    }
    if (JS_IsUndefined(*rect) || JS_IsNull(*rect)) {
        JS_PopGCRef(ctx, &rect_ref);
        return true;
    }
    if (!value_is_object(ctx, *rect) ||
        !read_i32_property(ctx, *rect, "x", api_name, &out->destination_x,
                           &present) ||
        !read_i32_property(ctx, *rect, "y", api_name, &out->destination_y,
                           &present) ||
        !read_u32_property(ctx, *rect, "width", api_name,
                           &out->destination_width, &size_present) ||
        !size_present ||
        !read_u32_property(ctx, *rect, "height", api_name,
                           &out->destination_height, &size_present) ||
        !size_present || out->destination_width == 0 ||
        out->destination_height == 0) {
        JS_PopGCRef(ctx, &rect_ref);
        if (!JS_HasException(ctx)) {
            JS_ThrowRangeError(ctx, "%s destinationRect requires positive dimensions",
                               api_name);
        }
        return false;
    }
    JS_PopGCRef(ctx, &rect_ref);
    return true;
}

static bool parse_transform_options(
    JSContext *ctx,
    JSValue options,
    const char *api_name,
    const esp32_mquickjs_bitmap_view_t *source,
    esp32_mquickjs_bitmap_pixel_format_t target_format,
    bool convert,
    esp32_mquickjs_bitmap_transform_options_t *out,
    uint32_t *out_convert_width,
    uint32_t *out_convert_height)
{
    JSCStringBuf filter_buf;
    JSCStringBuf dither_buf;
    const char *filter = NULL;
    const char *dither = NULL;
    bool present;
    bool threshold_present;
    bool dither_present;
    uint32_t rotation = 0;
    uint32_t threshold = 128;
    uint32_t natural_width;
    uint32_t natural_height;

    memset(out, 0, sizeof(*out));
    out->filter = ESP32_MQUICKJS_BITMAP_FILTER_NEAREST;
    out->dither = ESP32_MQUICKJS_BITMAP_DITHER_NONE;
    out->threshold = 128;
    if (!parse_source_rect(ctx, options, api_name, source, out) ||
        !read_u32_property(ctx, options, "rotation", api_name, &rotation,
                           &present) ||
        (rotation != 0 && rotation != 90 && rotation != 180 &&
         rotation != 270) ||
        !read_bool_property(ctx, options, "flipX", api_name, &out->flip_x,
                            &present) ||
        !read_bool_property(ctx, options, "flipY", api_name, &out->flip_y,
                            &present) ||
        !read_bool_property(ctx, options, "normalize", api_name,
                            &out->normalize, &present) ||
        !read_string_property(ctx, options, "filter", api_name, &filter,
                              &filter_buf, &present) ||
        !read_string_property(ctx, options, "dither", api_name, &dither,
                              &dither_buf, &dither_present) ||
        !read_u32_property(ctx, options, "threshold", api_name, &threshold,
                           &threshold_present)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "%s received invalid transform options",
                              api_name);
        }
        return false;
    }
    out->rotation = (uint16_t)rotation;
    if (filter != NULL && strcmp(filter, "nearest") == 0) {
        out->filter = ESP32_MQUICKJS_BITMAP_FILTER_NEAREST;
    } else if (filter != NULL && strcmp(filter, "bilinear") == 0) {
        out->filter = ESP32_MQUICKJS_BITMAP_FILTER_BILINEAR;
    } else if (filter != NULL) {
        JS_ThrowTypeError(ctx, "%s filter expects 'nearest' or 'bilinear'",
                          api_name);
        return false;
    }
    if (dither != NULL && strcmp(dither, "none") == 0) {
        out->dither = ESP32_MQUICKJS_BITMAP_DITHER_NONE;
    } else if (dither != NULL && strcmp(dither, "bayer4x4") == 0) {
        out->dither = ESP32_MQUICKJS_BITMAP_DITHER_BAYER_4X4;
    } else if (dither != NULL) {
        JS_ThrowTypeError(ctx, "%s dither expects 'none' or 'bayer4x4'",
                          api_name);
        return false;
    }
    if (threshold > 255U ||
        ((threshold_present || dither_present) &&
         target_format != ESP32_MQUICKJS_BITMAP_FORMAT_MONO1) ||
        (out->normalize &&
         !esp32_mquickjs_bitmap_format_info(target_format)->grayscale)) {
        JS_ThrowTypeError(
            ctx,
            "%s normalize is grayscale-only and threshold/dither are mono1-only",
            api_name);
        return false;
    }
    out->threshold = (uint8_t)threshold;
    natural_width = rotation == 90 || rotation == 270
                        ? out->source_height
                        : out->source_width;
    natural_height = rotation == 90 || rotation == 270
                         ? out->source_width
                         : out->source_height;
    if (convert) {
        uint32_t width = natural_width;
        uint32_t height = natural_height;
        bool width_present;
        bool height_present;

        if (!read_u32_property(ctx, options, "width", api_name, &width,
                               &width_present) ||
            !read_u32_property(ctx, options, "height", api_name, &height,
                               &height_present) ||
            width == 0 || height == 0 || width > BITMAP_MAX_DIMENSION ||
            height > BITMAP_MAX_DIMENSION) {
            if (!JS_HasException(ctx)) {
                JS_ThrowRangeError(ctx, "%s output dimensions are invalid",
                                   api_name);
            }
            return false;
        }
        (void)width_present;
        (void)height_present;
        out->destination_x = 0;
        out->destination_y = 0;
        out->destination_width = width;
        out->destination_height = height;
        *out_convert_width = width;
        *out_convert_height = height;
        return true;
    }
    return parse_destination_rect(ctx, options, api_name, natural_width,
                                  natural_height, out);
}

