99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_image.c
static bool ranges_overlap(const uint8_t *first,
                           size_t first_length,
                           const uint8_t *second,
                           size_t second_length)
{
    uintptr_t first_start = (uintptr_t)first;
    uintptr_t second_start = (uintptr_t)second;
    uintptr_t first_end = first_length > UINTPTR_MAX - first_start
                              ? UINTPTR_MAX
                              : first_start + first_length;
    uintptr_t second_end = second_length > UINTPTR_MAX - second_start
                               ? UINTPTR_MAX
                               : second_start + second_length;

    return first_start < second_end && second_start < first_end;
}

static void release_state_resources(
    esp32_mquickjs_future_driver_state_t *state)
{
    uint32_t operation_index;

    if (state == NULL) {
        return;
    }
    for (operation_index = 0; operation_index < state->operation_count;
         ++operation_index) {
        release_state_resources(&state->operations[operation_index]);
    }
    heap_caps_free(state->operations);
    state->operations = NULL;
    state->operation_count = 0;
    if (state->target_write_acquired && state->target_bitmap != NULL) {
        bitmap_release_write(state->target_bitmap);
        state->target_write_acquired = false;
    }
    if (state->result_bitmap != NULL && state->result_bitmap->write_lease) {
        bitmap_release_write(state->result_bitmap);
    }
    if (state->source_owner == BITMAP_SOURCE_BITMAP &&
        state->source_bitmap != NULL) {
        bitmap_release_read(state->source_bitmap);
    } else if (state->source_owner == BITMAP_SOURCE_BYTE_VIEW &&
               state->pixels_rooted) {
        esp32_mquickjs_byte_view_release_read(state->ctx,
                                              state->pixels_ref.val);
#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
    } else if (state->source_owner == BITMAP_SOURCE_CAMERA) {
        esp32_mquickjs_camera_frame_release_bitmap_view(&state->camera_lease);
#endif
    }
    state->source_owner = BITMAP_SOURCE_NONE;
    state->source_bitmap = NULL;
    state->target_bitmap = NULL;
    heap_caps_free(state->staging);
    state->staging = NULL;
    if (state->source_rooted) {
        JS_DeleteGCRef(state->ctx, &state->source_ref);
        state->source_rooted = false;
    }
    if (state->pixels_rooted) {
        JS_DeleteGCRef(state->ctx, &state->pixels_ref);
        state->pixels_rooted = false;
    }
    if (state->target_rooted) {
        JS_DeleteGCRef(state->ctx, &state->target_ref);
        state->target_rooted = false;
    }
}

static void destroy_unstarted_state(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    release_state_resources(state);
    bitmap_free(state->result_bitmap);
    state->result_bitmap = NULL;
    heap_caps_free(state);
}

static bool prepare_convert(
    JSContext *ctx,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    JSCStringBuf format_buf;
    JSCStringBuf layout_buf;
    JSCStringBuf storage_buf;
    const char *format = NULL;
    const char *layout = NULL;
    const char *storage = NULL;
    bool format_present;
    bool layout_present;
    bool storage_present;
    bool stride_present;
    uint32_t width = 0;
    uint32_t height = 0;
    uint32_t stride = 0;
    uint8_t storage_value;
    esp32_mquickjs_bitmap_pixel_format_t target_format;
    esp32_mquickjs_bitmap_layout_t target_layout;
    uint32_t foreground;

    if (out_state == NULL || argc != 2 || !value_is_object(ctx, argv[1].val)) {
        JS_ThrowTypeError(ctx, "%s expects source and options", BITMAP_CONVERT_API);
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    atomic_init(&state->completed, false);
    atomic_init(&state->cancelled, false);
    state->ctx = ctx;
    state->convert = true;
    if (!source_from_value(ctx, argv[0].val, BITMAP_CONVERT_API, state) ||
        !read_string_property(ctx, argv[1].val, "format", BITMAP_CONVERT_API,
                              &format, &format_buf, &format_present) ||
        !format_present || !parse_format(format, &target_format) ||
        !read_string_property(ctx, argv[1].val, "layout", BITMAP_CONVERT_API,
                              &layout, &layout_buf, &layout_present) ||
        !parse_layout(layout_present ? layout : NULL, target_format, false,
                      &target_layout) ||
        !read_string_property(ctx, argv[1].val, "storage", BITMAP_CONVERT_API,
                              &storage, &storage_buf, &storage_present) ||
        !parse_storage(storage_present ? storage : NULL, &storage_value) ||
        !read_u32_property(ctx, argv[1].val, "stride", BITMAP_CONVERT_API,
                           &stride, &stride_present) ||
        !parse_transform_options(ctx, argv[1].val, BITMAP_CONVERT_API,
                                 &state->source, target_format, true,
                                 &state->options, &width, &height)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "%s received invalid output options",
                              BITMAP_CONVERT_API);
        }
        destroy_unstarted_state(state);
        return false;
    }
    foreground = esp32_mquickjs_bitmap_format_info(target_format)->maximum_color;
    state->result_bitmap = bitmap_allocate(
        ctx, width, height, (uint8_t)target_format, (uint8_t)target_layout,
        storage_value, stride_present ? stride : 0, BITMAP_DEFAULT_CHUNK_BYTES,
        foreground, 0);
    if (state->result_bitmap == NULL ||
        !bitmap_acquire_write(ctx, state->result_bitmap, BITMAP_CONVERT_API)) {
        destroy_unstarted_state(state);
        return false;
    }
    state->target.data = state->result_bitmap->data;
    state->target.length = state->result_bitmap->byte_length;
    state->target.width = state->result_bitmap->width;
    state->target.height = state->result_bitmap->height;
    state->target.stride = state->result_bitmap->stride;
    state->target.format = target_format;
    state->target.layout = target_layout;
    state->target.byte_order = ESP32_MQUICKJS_BITMAP_BYTE_ORDER_BE;
    state->target.bit_order = ESP32_MQUICKJS_BITMAP_BIT_ORDER_LSB;
    *out_state = state;
    return true;
}

