99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_image.c
static bool parse_blit_operation_options(
    JSContext *ctx,
    JSValue options,
    const char *api_name,
    esp32_mquickjs_future_driver_state_t *operation,
    esp32_mquickjs_bitmap_pixel_format_t target_format)
{
    uint32_t ignored_width = 0;
    uint32_t ignored_height = 0;

    if (JS_IsUndefined(options)) {
        JSGCRef empty_ref;
        JSValue *empty = JS_PushGCRef(ctx, &empty_ref);
        bool result;

        *empty = JS_NewObject(ctx);
        result = !JS_IsException(*empty) &&
                 parse_transform_options(
                     ctx, *empty, api_name, &operation->source,
                     target_format, false, &operation->options,
                     &ignored_width, &ignored_height);
        JS_PopGCRef(ctx, &empty_ref);
        return result;
    }
    if (!value_is_object(ctx, options)) {
        JS_ThrowTypeError(ctx, "%s operation options must be an object",
                          api_name);
        return false;
    }
    return parse_transform_options(
        ctx, options, api_name, &operation->source, target_format, false,
        &operation->options, &ignored_width, &ignored_height);
}

static bool prepare_blit(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_bitmap_t *target;
    JSValue options = argc >= 2 ? argv[1].val : JS_UNDEFINED;

    if (out_state == NULL || argc < 1 || argc > 2 ||
        (!JS_IsUndefined(options) && !value_is_object(ctx, options))) {
        JS_ThrowTypeError(ctx, "%s expects source and optional options",
                          BITMAP_BLIT_API);
        return false;
    }
    target = bitmap_from_value(ctx, this_ref->val, BITMAP_BLIT_API);
    if (target == NULL) {
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    atomic_init(&state->completed, false);
    atomic_init(&state->cancelled, false);
    state->ctx = ctx;
    state->target_bitmap = target;
    if (!source_from_value(ctx, argv[0].val, BITMAP_BLIT_API, state) ||
        state->source_bitmap == target ||
        ranges_overlap(state->source.data, state->source.length, target->data,
                       target->byte_length) ||
        !root_value(ctx, &state->target_ref, &state->target_rooted,
                    this_ref->val)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "%s does not allow aliased or in-place input",
                              BITMAP_BLIT_API);
        }
        destroy_unstarted_state(state);
        return false;
    }
    if (!bitmap_acquire_write(ctx, target, BITMAP_BLIT_API)) {
        destroy_unstarted_state(state);
        return false;
    }
    state->target_write_acquired = true;
    state->target.data = target->data;
    state->target.length = target->byte_length;
    state->target.width = target->width;
    state->target.height = target->height;
    state->target.stride = target->stride;
    state->target.format =
        (esp32_mquickjs_bitmap_pixel_format_t)target->format;
    state->target.layout = (esp32_mquickjs_bitmap_layout_t)target->layout;
    state->target.byte_order = ESP32_MQUICKJS_BITMAP_BYTE_ORDER_BE;
    state->target.bit_order = ESP32_MQUICKJS_BITMAP_BIT_ORDER_LSB;
    if (!parse_blit_operation_options(
            ctx, options, BITMAP_BLIT_API, state, state->target.format)) {
        destroy_unstarted_state(state);
        return false;
    }
    *out_state = state;
    return true;
}

static bool bitmap_array_length(JSContext *ctx,
                                JSValue value,
                                uint32_t *out_length)
{
    JSGCRef length_ref;
    JSValue *length = JS_PushGCRef(ctx, &length_ref);
    int raw_length;
    bool result = false;

    if (out_length == NULL || !JS_IsArray(ctx, value)) {
        JS_ThrowTypeError(ctx, "%s expects one operation array",
                          BITMAP_BLIT_BATCH_API);
        goto done;
    }
    *length = JS_GetPropertyStr(ctx, value, "length");
    if (JS_IsException(*length) ||
        JS_ToInt32(ctx, &raw_length, *length) != 0 || raw_length < 0) {
        if (!JS_HasException(ctx)) {
            JS_ThrowRangeError(ctx, "%s operation array length is invalid",
                               BITMAP_BLIT_BATCH_API);
        }
        goto done;
    }
    *out_length = (uint32_t)raw_length;
    result = true;

done:
    JS_PopGCRef(ctx, &length_ref);
    return result;
}

static bool prepare_blit_batch(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_bitmap_t *target;
    uint32_t operation_count;
    uint32_t operation_index;

    if (out_state == NULL || argc != 1 ||
        !bitmap_array_length(ctx, argc == 1 ? argv[0].val : JS_UNDEFINED,
                             &operation_count)) {
        return false;
    }
    if (operation_count == 0 ||
        operation_count > BITMAP_BLIT_BATCH_MAX_OPERATIONS) {
        JS_ThrowRangeError(ctx, "%s expects 1..16 operations",
                           BITMAP_BLIT_BATCH_API);
        return false;
    }
    target = bitmap_from_value(ctx, this_ref->val, BITMAP_BLIT_BATCH_API);
    if (target == NULL) {
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->operations = heap_caps_calloc(
        operation_count, sizeof(*state->operations), MALLOC_CAP_8BIT);
    if (state->operations == NULL) {
        heap_caps_free(state);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    atomic_init(&state->completed, false);
    atomic_init(&state->cancelled, false);
    state->ctx = ctx;
    state->batch = true;
    state->target_bitmap = target;
    state->operation_count = operation_count;
    state->target.data = target->data;
    state->target.length = target->byte_length;
    state->target.width = target->width;
    state->target.height = target->height;
    state->target.stride = target->stride;
    state->target.format =
        (esp32_mquickjs_bitmap_pixel_format_t)target->format;
    state->target.layout = (esp32_mquickjs_bitmap_layout_t)target->layout;
    state->target.byte_order = ESP32_MQUICKJS_BITMAP_BYTE_ORDER_BE;
    state->target.bit_order = ESP32_MQUICKJS_BITMAP_BIT_ORDER_LSB;
    if (!root_value(ctx, &state->target_ref, &state->target_rooted,
                    this_ref->val)) {
        destroy_unstarted_state(state);
        return false;
    }
    for (operation_index = 0; operation_index < operation_count;
         ++operation_index) {
        esp32_mquickjs_future_driver_state_t *operation =
            &state->operations[operation_index];
        JSGCRef item_ref;
        JSGCRef source_ref;
        JSGCRef options_ref;
        JSValue *item = JS_PushGCRef(ctx, &item_ref);
        JSValue *source = JS_PushGCRef(ctx, &source_ref);
        JSValue *options = JS_PushGCRef(ctx, &options_ref);
        bool ok;

