99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_image.c
        operation->ctx = ctx;
        operation->target = state->target;
        *item = JS_GetPropertyUint32(ctx, argv[0].val, operation_index);
        *source = JS_IsException(*item)
                      ? JS_EXCEPTION
                      : JS_GetPropertyStr(ctx, *item, "source");
        *options = JS_IsException(*item)
                       ? JS_EXCEPTION
                       : JS_GetPropertyStr(ctx, *item, "options");
        ok = !JS_IsException(*item) && value_is_object(ctx, *item) &&
             !JS_IsException(*source) && !JS_IsUndefined(*source) &&
             !JS_IsNull(*source) && !JS_IsException(*options) &&
             source_from_value(ctx, *source, BITMAP_BLIT_BATCH_API,
                               operation) &&
             operation->source_bitmap != target &&
             !ranges_overlap(operation->source.data,
                             operation->source.length, target->data,
                             target->byte_length) &&
             parse_blit_operation_options(
                 ctx, *options, BITMAP_BLIT_BATCH_API, operation,
                 state->target.format);
        JS_PopGCRef(ctx, &options_ref);
        JS_PopGCRef(ctx, &source_ref);
        JS_PopGCRef(ctx, &item_ref);
        if (!ok) {
            if (!JS_HasException(ctx)) {
                JS_ThrowTypeError(
                    ctx,
                    "%s operation %u requires non-aliased source and optional options",
                    BITMAP_BLIT_BATCH_API, (unsigned)operation_index);
            }
            destroy_unstarted_state(state);
            return false;
        }
    }
    if (!bitmap_acquire_write(ctx, target, BITMAP_BLIT_BATCH_API)) {
        destroy_unstarted_state(state);
        return false;
    }
    state->target_write_acquired = true;
    *out_state = state;
    return true;
}

static bool bitmap_convert_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    (void)this_ref;
    return prepare_convert(ctx, argc, argv, out_state);
}

static bool bitmap_blit_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return prepare_blit(ctx, this_ref, argc, argv, out_state);
}

static bool bitmap_blit_batch_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return prepare_blit_batch(ctx, this_ref, argc, argv, out_state);
}

static bool transform_cancelled(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    return state == NULL || atomic_load_explicit(
                                &state->cancelled, memory_order_acquire);
}

static void bitmap_transform_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state == NULL) {
        return;
    }
    state->result = esp32_mquickjs_bitmap_transform(
        &state->source, &state->target, &state->options,
        transform_cancelled, state, &state->rows_completed, &state->dirty);
    atomic_store_explicit(&state->completed, true, memory_order_release);
}

static void bitmap_transform_batch_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    uint32_t operation_index;

    if (state == NULL) {
        return;
    }
    state->result = ESP32_MQUICKJS_BITMAP_TRANSFORM_OK;
    for (operation_index = 0; operation_index < state->operation_count;
         ++operation_index) {
        esp32_mquickjs_future_driver_state_t *operation =
            &state->operations[operation_index];

        operation->started = true;
        operation->result = esp32_mquickjs_bitmap_transform(
            &operation->source, &operation->target, &operation->options,
            transform_cancelled, state, &operation->rows_completed,
            &operation->dirty);
        if (operation->result != ESP32_MQUICKJS_BITMAP_TRANSFORM_OK) {
            state->result = operation->result;
            break;
        }
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
}

static bool bitmap_transform_start(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        JS_ThrowInternalError(ctx, "Bitmap transform state is missing");
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (!esp32_mquickjs_future_submit_worker(
            runtime, token,
            state->batch ? bitmap_transform_batch_worker
                         : bitmap_transform_worker,
            state)) {
        JS_ThrowInternalError(ctx, "Bitmap transform worker queue is full");
        return false;
    }
    return true;
}

static esp32_mquickjs_future_poll_t bitmap_transform_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL && atomic_load_explicit(
                                &state->completed, memory_order_acquire)
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue bitmap_transform_finish(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state)
{
    JSValue result;

    if (state == NULL || state->result == ESP32_MQUICKJS_BITMAP_TRANSFORM_INVALID) {
        return JS_ThrowInternalError(ctx, "Bitmap transform failed");
    }
    if (state->batch && state->target_bitmap != NULL) {
        uint32_t operation_index;

        for (operation_index = 0; operation_index < state->operation_count;
             ++operation_index) {
            esp32_mquickjs_future_driver_state_t *operation =
                &state->operations[operation_index];

            if (operation->started &&
                (operation->result == ESP32_MQUICKJS_BITMAP_TRANSFORM_OK ||
                 operation->rows_completed != 0)) {
                mark_dirty(state->target_bitmap,
                           operation->options.destination_x,
                           operation->options.destination_y,
                           (int)operation->options.destination_width,
                           (int)operation->options.destination_height);
            }
        }
    } else if (!state->convert && state->target_bitmap != NULL &&
        (state->result == ESP32_MQUICKJS_BITMAP_TRANSFORM_OK ||
         state->rows_completed != 0)) {
        mark_dirty(state->target_bitmap, state->options.destination_x,
                   state->options.destination_y,
                   (int)state->options.destination_width,
                   (int)state->options.destination_height);
    }
    if (state->result == ESP32_MQUICKJS_BITMAP_TRANSFORM_CANCELLED ||
        atomic_load_explicit(&state->cancelled, memory_order_acquire)) {
        return JS_ThrowInternalError(ctx, "Bitmap transform cancelled");
    }
    if (!state->convert) {
        return state->target_ref.val;
    }
    bitmap_release_write(state->result_bitmap);
    mark_dirty(state->result_bitmap, 0, 0, state->result_bitmap->width,
               state->result_bitmap->height);
    result = bitmap_wrap(ctx, state->result_bitmap);
    if (!JS_IsException(result)) {
        state->result_bitmap = NULL;
    }
    return result;
}

