99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_image.c
static esp32_mquickjs_cancel_result_t bitmap_transform_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL ||
        atomic_load_explicit(&state->completed, memory_order_acquire) ||
        atomic_load_explicit(&state->cancelled, memory_order_acquire)) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    atomic_store_explicit(&state->cancelled, true, memory_order_release);
    return ESP32_MQUICKJS_CANCEL_REQUESTED;
}

static void bitmap_transform_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    release_state_resources(state);
    bitmap_free(state->result_bitmap);
    state->result_bitmap = NULL;
    heap_caps_free(state);
}

static const esp32_mquickjs_future_driver_t s_bitmap_convert_driver = {
    .capture = bitmap_convert_prepare,
    .start = bitmap_transform_start,
    .poll = bitmap_transform_poll,
    .finish = bitmap_transform_finish,
    .cancel = bitmap_transform_cancel,
    .destroy = bitmap_transform_destroy,
};

static const esp32_mquickjs_future_driver_t s_bitmap_blit_driver = {
    .capture = bitmap_blit_prepare,
    .start = bitmap_transform_start,
    .poll = bitmap_transform_poll,
    .finish = bitmap_transform_finish,
    .cancel = bitmap_transform_cancel,
    .destroy = bitmap_transform_destroy,
};

static const esp32_mquickjs_future_driver_t s_bitmap_blit_batch_driver = {
    .capture = bitmap_blit_batch_prepare,
    .start = bitmap_transform_start,
    .poll = bitmap_transform_poll,
    .finish = bitmap_transform_finish,
    .cancel = bitmap_transform_cancel,
    .destroy = bitmap_transform_destroy,
};

bool esp32_mquickjs_init_bitmap_runtime(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref;
    JSGCRef module_ref;
    JSGCRef convert_ref;
    JSGCRef object_ref;
    JSGCRef blit_ref;
    JSGCRef blit_batch_ref;
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP_JPEG
    JSGCRef decode_ref;
#endif
    JSValue *global = JS_PushGCRef(ctx, &global_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref);
    JSValue *convert = JS_PushGCRef(ctx, &convert_ref);
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *blit = JS_PushGCRef(ctx, &blit_ref);
    JSValue *blit_batch = JS_PushGCRef(ctx, &blit_batch_ref);
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP_JPEG
    JSValue *decode = JS_PushGCRef(ctx, &decode_ref);
#endif
    bool result;

    *global = JS_GetGlobalObject(ctx);
    *module = JS_IsException(*global)
                  ? JS_EXCEPTION
                  : JS_GetPropertyStr(ctx, *global, "bitmap");
    *convert = JS_IsException(*module)
                   ? JS_EXCEPTION
                   : JS_GetPropertyStr(ctx, *module, "convert");
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BITMAP);
    *blit = JS_IsException(*object)
                ? JS_EXCEPTION
                : JS_GetPropertyStr(ctx, *object, "blit");
    *blit_batch = JS_IsException(*object)
                      ? JS_EXCEPTION
                      : JS_GetPropertyStr(ctx, *object, "blitBatch");
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP_JPEG
    *decode = JS_IsException(*object)
                  ? JS_EXCEPTION
                  : JS_GetPropertyStr(ctx, *object, "decode");
#endif
    result = !JS_IsException(*convert) && !JS_IsException(*blit) &&
             !JS_IsException(*blit_batch) &&
             esp32_mquickjs_future_register_driver(
                 ctx, runtime, *convert, &s_bitmap_convert_driver) &&
             esp32_mquickjs_future_register_driver(
                 ctx, runtime, *blit, &s_bitmap_blit_driver) &&
             esp32_mquickjs_future_register_driver(
                 ctx, runtime, *blit_batch, &s_bitmap_blit_batch_driver);
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP_JPEG
    result = result && !JS_IsException(*decode) &&
             esp32_mquickjs_register_bitmap_jpeg_driver(
                 ctx, runtime, *decode);
#endif
    if (!result && !JS_HasException(ctx)) {
        JS_ThrowInternalError(ctx, "failed to register Bitmap Future drivers");
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP_JPEG
    JS_PopGCRef(ctx, &decode_ref);
#endif
    JS_PopGCRef(ctx, &blit_batch_ref);
    JS_PopGCRef(ctx, &blit_ref);
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &convert_ref);
    JS_PopGCRef(ctx, &module_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

void esp32_mquickjs_deinit_bitmap_runtime(JSContext *ctx)
{
    (void)ctx;
}

JSValue js_bitmap_convert(JSContext *ctx, JSValue *this_val,
                          int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = JS_GetPropertyStr(ctx, *this_val, "convert");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_bitmap_blit(JSContext *ctx, JSValue *this_val,
                       int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = JS_GetPropertyStr(ctx, *this_val, "blit");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_bitmap_blit_batch(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = JS_GetPropertyStr(ctx, *this_val, "blitBatch");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

#endif
